app/Controllers/CabangController.php

SELECT *
FROM `tb_cabang`
---
    public function list()
    {
        $model = new MCabang();

        // Pilih kolom yang ingin dikembalikan
        $cabang = $model->select([
            'id',
            'nama',
            'alamat',
            'kota',
            'propinsi',
            'kodepos',
            'telp',
            'email'
        ])->findAll();