app/Models/MKategori.php

    public function kategoribyproduk()
    {
        // Query untuk mendapatkan data kategori yang diinginkan
        return $this->findAll(); // Atau gunakan query builder jika ada kondisi khusus
---
SELECT *
FROM `tb_kategori`