app/Models/MProduk.php

SELECT *
FROM `tb_produk`
WHERE `idkategori` = '3'
AND `thumbnail` <> ''
AND `st` = '1'
 LIMIT 5
---
    public function produkbykategori($id)
    {
        return $this->where('idkategori', $id)
                    ->where('thumbnail <>', '')
                    ->where('st', '1')
                    ->limit(5)
                    ->asObject()
                    ->findAll();